app/Controllers/Home.php

    public function index()
    {
        $product = $this->product->findAll();
---
SELECT *
FROM `product`